{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"behavior_input": {"name": "behavior_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "8"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "behavior_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Shape", "op": "Shape", "input": ["behavior_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/transpose", "op": "Transpose", "input": ["behavior_input", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Shape", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack_1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/transpose", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/packed", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25", "op": "NoOp", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_22", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_23", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopControlInputs/_25"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvY29nbmVlX2FpX3YxXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_17", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_48"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_21", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_19", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_50"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_16", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_47"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_20", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_51"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_18", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_49"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/input_control_node/_53", "op": "NoOp", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_22", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_23", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_24", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_26", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_27", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_28", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_29", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_30", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_26", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_27", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/input_control_node/_53"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/input_control_node/_53"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_28", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less_1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less"]}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32", "op": "LoopCond", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_29", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_26", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_31", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_28", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_30", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/merge/_27", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/LoopCond/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_40", "op": "Exit", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_body_control/_39", "op": "Identity", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter_switch/_33:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_42", "op": "Exit", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_41", "op": "Exit", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_43", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64", "op": "NoOp", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max_switch/_34", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor_switch/_38", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1_switch/_36", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time_switch/_35", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_body_control/_39", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros_switch/_37", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_22", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_23", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_24"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack_1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_22", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_23", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/enter/_24", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3", "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter_switch/_33:1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time_switch/_35:1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor_switch/_38:1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time_switch/_35:1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros_switch/_37:1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "op": "NoOp", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/mul_1", "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor_switch/_38:1", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_48", "op": "NextIteration", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max_switch/_34:1", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/NoOp", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/input_control_node/_64"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_47", "op": "NextIteration", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add_1", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_49", "op": "NextIteration", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/add_1", "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/Relu", "StatefulPartitionedCall/cognee_ai_v1_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/cognee_ai_v1_1/output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1_switch/_36:1", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Tanh"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Tanh", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/output_1/Softmax", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_45", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_44", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_42", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_43", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_40", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/exit/_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/next_iteration/_50", "op": "NextIteration", "input": ["StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/output_control_node/_83", "^StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/mul", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/batch_norm_1/batchnorm/sub", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/Cast/ReadVariableOp", "shape": [48, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/dense_1_1/BiasAdd/ReadVariableOp", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/output_1/Cast/ReadVariableOp", "shape": [24, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/output_1/BiasAdd/ReadVariableOp", "shape": [5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/Max", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/time", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_1", "shape": [8, 48], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [48], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [48, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/cond/_14/cognee_ai_v1_1/rnn_1/while/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add_1/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast/ReadVariableOp", "shape": [8, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/add/ReadVariableOp", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cognee_ai_v1_1/rnn_1/while/body/_15/cognee_ai_v1_1/rnn_1/while/simple_rnn_cell_1/Cast_1/ReadVariableOp", "shape": [48, 48], "dtype": "float32"}]}]}